### Restart and Run All

In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3')
conlt = engine.connect()

pd.set_option('display.float_format','{:,.2f}'.format)
pd.set_option('display.max_rows',None)

year = 2023
quarter = 1

today = date.today()
today

datetime.date(2023, 2, 18)

In [2]:
sql = '''
SELECT name,year,quarter,q_amt 
FROM epss 
WHERE (year = %s AND quarter <= %s)
OR (year = %s-1 AND quarter >= %s+1) 
ORDER BY year DESC, quarter DESC'''
sql = sql % (year, quarter, year, quarter)
dfc = pd.read_sql(sql, conlt)
dfc['Counter'] = 1
dfc_grp = dfc.groupby(['name'], as_index=False).sum()
dfc_grp = dfc_grp[dfc_grp['Counter'] == 4]
dfc_grp

       name  year  quarter    q_amt  Counter
80   GVREIT  8089       10   643255        4
123      MC  8089       10   832309        4
131   OISHI  8089       10  1126122        4
193   TFFIF  8089       10  1921578        4

In [3]:
sql = '''
SELECT name,year,quarter,q_amt 
FROM epss 
WHERE (year = %s AND quarter <= %s-1) 
OR (year = %s-1 AND quarter >= %s) 
ORDER BY year DESC, quarter DESC'''
sql = sql % (year, quarter, year, quarter)
print(sql)

SELECT name,year,quarter,q_amt
FROM epss
WHERE (year = 2023 AND quarter <= 1-1)
OR (year = 2023-1 AND quarter >= 1)
ORDER BY year DESC, quarter DESC

In [4]:
dfp = pd.read_sql(sql, conlt)
dfp['Counter'] = 1
dfp_grp = dfp.groupby(['name'], as_index=False).sum()
dfp_grp = dfp_grp[dfp_grp['Counter'] == 4]
dfp_grp.shape

(71, 5)

In [5]:
dfm = pd.merge(dfc_grp, dfp_grp, on='name', suffixes=(['_c','_p']), how='inner')
dfm['inc_profit'] = dfm['q_amt_c']-dfm['q_amt_p']
dfm['Pct'] = round(dfm['inc_profit']/abs(dfm['q_amt_p'])*100,2)
dfm['year'] = year
dfm['quarter'] = 'Q'+str(quarter)
df_pct = dfm[['name','year','quarter','q_amt_c','q_amt_p','inc_profit','Pct']]
df_pct

     name  year quarter  q_amt_c  q_amt_p  inc_profit   Pct
0  GVREIT  2023      Q1   643255   642743         512  0.08
1      MC  2023      Q1   832309   740276       92033 12.43
2   OISHI  2023      Q1  1126122  1197453      -71331 -5.96
3   TFFIF  2023      Q1  1921578  1851409       70169  3.79

In [6]:
sql = """
DELETE FROM qt_profits 
WHERE year = %s AND quarter = 'Q%s'"""
sql = sql % (year,quarter)
print(sql)

DELETE FROM qt_profits
WHERE year = 2023 AND quarter = 'Q1'

In [7]:
rp = conlt.execute(sql)
rp.rowcount

0

In [8]:
sql = 'SELECT name, id FROM tickers'
tickers = pd.read_sql(sql, conlt)
tickers.shape

(401, 2)

In [9]:
df_ins = pd.merge(df_pct, tickers, on='name', how='inner')
df_ins.dtypes

name           object
year            int64
quarter        object
q_amt_c         int64
q_amt_p         int64
inc_profit      int64
Pct           float64
id              int64
dtype: object

In [10]:
rcds = df_ins.values.tolist()
len(rcds)

4

In [11]:
for rcd in rcds:
    print(rcd)

['GVREIT', 2023, 'Q1', 643255, 642743, 512, 0.08, 654]
['MC', 2023, 'Q1', 832309, 740276, 92033, 12.43, 291]
['OISHI', 2023, 'Q1', 1126122, 1197453, -71331, -5.96, 338]
['TFFIF', 2023, 'Q1', 1921578, 1851409, 70169, 3.79, 686]

In [12]:
sql = """
INSERT INTO qt_profits (name, year, quarter, latest_amt, previous_amt, inc_amt, inc_pct, ticker_id) \
 VALUES (?, ?, ?, ?, ?, ?, ?, ?)"""
print(sql)

INSERT INTO qt_profits (name, year, quarter, latest_amt, previous_amt, inc_amt, inc_pct, ticker_id)  VALUES (?, ?, ?, ?, ?, ?, ?, ?)

In [13]:
for rcd in rcds:
    conlt.execute(sql, rcd)

### End of loop

In [14]:
cols = 'name year quarter q_amt_c q_amt_p inc_profit Pct'.split()

In [15]:
criteria_1 = df_ins.q_amt_c > 440000
df_ins.loc[criteria_1,cols].sort_values(['Pct'],ascending=[False]).head()

     name  year quarter  q_amt_c  q_amt_p  inc_profit   Pct
1      MC  2023      Q1   832309   740276       92033 12.43
3   TFFIF  2023      Q1  1921578  1851409       70169  3.79
0  GVREIT  2023      Q1   643255   642743         512  0.08
2   OISHI  2023      Q1  1126122  1197453      -71331 -5.96

In [16]:
criteria_2 = df_ins.q_amt_p > 400000
df_ins.loc[criteria_2,cols].sort_values(['Pct'],ascending=[False]).head()

     name  year quarter  q_amt_c  q_amt_p  inc_profit   Pct
1      MC  2023      Q1   832309   740276       92033 12.43
3   TFFIF  2023      Q1  1921578  1851409       70169  3.79
0  GVREIT  2023      Q1   643255   642743         512  0.08
2   OISHI  2023      Q1  1126122  1197453      -71331 -5.96

In [17]:
criteria_3 = df_ins.Pct > 10
df_ins.loc[criteria_3,cols].sort_values(['Pct'],ascending=[False]).head()

  name  year quarter  q_amt_c  q_amt_p  inc_profit   Pct
1   MC  2023      Q1   832309   740276       92033 12.43

In [18]:
df_ins_criteria = criteria_1 & criteria_2 & criteria_3
df_ins.loc[df_ins_criteria,cols].sort_values(['Pct'],ascending=[False]).head()

  name  year quarter  q_amt_c  q_amt_p  inc_profit   Pct
1   MC  2023      Q1   832309   740276       92033 12.43